app/views/users/_unfollow.html.erb

<%= form_for(current_user.active_followers.find_by(followed_id: @user.id),
             html: { method: :delete },
             remote: true) do |f| %>
---
SELECT  "followers".* FROM "followers" WHERE "followers"."follower_id" = ? AND "followers"."followed_id" = ? LIMIT 1  [["follower_id", 1], ["followed_id", 3]]