app/views/users/show.html.erb

  <div class="col-md-8">
    <% if @user.posts.any? %>
---
SELECT  1 AS one FROM "posts" WHERE "posts"."user_id" = ? LIMIT 1  [["user_id", 1]]