app/controllers/followers_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	def create
		@user = User.find(params[:followed_id])

SELECT  "followers".* FROM "followers" WHERE "followers"."follower_id" = ? AND "followers"."followed_id" = ? LIMIT 1  [["follower_id", 1], ["followed_id", 3]]
---
	def destroy
		@user = Follower.find(params[:id]).followed