app/controllers/password_resets_controller.rb

  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$DpJwWCKdlcC2YNnBlk8ZtO7vR/IEuVWShXUB0JZwyJ59aEJJwTr3K"], ["updated_at", "2015-10-10 00:30:33.572242"], ["id", 106]]