app/controllers/posts_controller.rb

	def create
		@post = current_user.posts.build(post_params)
		if @post.save
---
INSERT INTO "posts" ("content", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "hello"], ["picture", "IMG_3275.JPG"], ["user_id", 1], ["created_at", "2015-10-13 18:01:28.923025"], ["updated_at", "2015-10-13 18:01:28.923025"]]