app/controllers/welcome_controller.rb

SELECT  "posts".* FROM "posts" WHERE (user_id = 1)  ORDER BY "posts"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE (user_id IN (SELECT followed_id FROM followers
---
  def index
  	if logged_in?
      @post  = current_user.posts.build
      @feed_items = current_user.feed.paginate(page: params[:page])